In [4]:
import pandas as pd

In [5]:
xlsfile = pd.ExcelFile('lec28_test.xlsx')

In [6]:
dframe = xlsfile.parse('Sheet1')

In [7]:
dframe

   This is a test  Unnamed: 1  Unnamed: 2
0              23        6678         456
1             234         678         456
2             234           7         345
3              34          56         234
4               5         456        4356